{"staff_1":{"last_name":"Oddo","first_name":"Eileen","lives_in":"\"White Plains, NY\"","position":"Director, Owner","bio":"Musical Munchkins grew out of Eileen’s deep connection to music that is formed while teaching children to create it. Watching a child make beautiful music for the first time is a joyful, magical experience for a dedicated music teacher!  \n\nEileen’s has a Bachelor of Music in Piano Performance and Pedagogy from Loyola University (’81) A Piano Diploma from the Conservatoire de Cachan, France (’83) and her Dalcroze Eurhythmics Certification from the Manhattan School of Music (’84). Post graduate studies in Eurhythmics and Orff-Kodaly were obtained with Jack Stevenson at Ithaca College and Marta Sanchez at Carnegie-Mellon University.  \n\nMoving to White Plains, NY in 1984, she worked at Westchester Conservatory of Music in the Eurhythmics and Piano Departments. Musical Munchkins was born from these experiences, and has grown over 37 years into a program that includes 10 teachers, 7 locations and music preschool contracts throughout Westchester County. She has published 7 recordings and 2 books under the Musical Munchkins label and continues to produce new materials with her staff.    \n\nEileen is a member of Westchester Association for the Education of Young Children and has lectured at local, state and national educational conferences. She even sang on the steps of the Capitol in Washington D.C. to open the 1990 NAEYC National Conference.  \n\nEileen lives in White Plains, New York and remains steadfast in her love for teaching at her home piano studio. She has two musical adult children, both former Munchkins and a musical cat. (Bondi plays the piano regularly and stretches out on the rug while Eileen is practicing!) ","img_url":"https://imagedelivery.net/7urfTiC8XtiqnXYk5tfRRg/cbfc5f3e-7b93-4cbd-c6b9-e97c363dd600/public"},"staff_2":{"last_name":"Berman","first_name":"Rachel","lives_in":"\"Riverdale, NY\"","position":"Instructor","bio":"Rachel has her Bachelor of Music from Oberlin College and her Master’s Degree in Voice from Manhattan School of Music. As a young singer, with many professional credentials as a soloist and choral singer, as well as musical theater and operatic performances to her credit, her future as a classical artist was looking very bright. Working with kids was nowhere on the horizon until her first child was born. Overnight, the allure of traveling the world to work and sing lost it’s luster and she found a new passion teaching music to young children! Rachel has been delighting toddlers at Musical Munchkins for nearly 30 years with her warmth and effusive energy. \n\nAlways the performer, Rachel has a style and sense of timing that makes her classes tremendously fun and inventive. She is patient and kind and has an intuitive sense for connecting with each child and the adults who accompany them to class.\n\nRachel lives in Riverdale, NY with her husband, Michael. She is an accomplished flutist and passionate ballroom and Latin dancer. She is currently writing children’s stories and hoping one day to publish picture books.","img_url":"https://imagedelivery.net/7urfTiC8XtiqnXYk5tfRRg/71b0a817-7e9a-422d-7186-08eb064e6400/public"},"staff_3":{"last_name":"Smith","first_name":"Marcy","lives_in":"\"Yonkers, NY\"","position":"Instructor","bio":"Marcy came to Musical Munchkins when her daughter was 2 years old. “As a music educator, I was so impressed by the warmth, fun, and real music education that was going on at such a very young age!”\n\nMarcy was born in Montreal, Canada. She received her B.A. in Music and Applied Social Science from Sir George Williams University. She earned her Masters degree in Educational Media and Technology from Concordia University, and her Ed.M. in Education from Harvard University.\n\nAs part of the Musical Munchkins team, Marcy has been involved in teacher training, curriculum development, and promotion and advertising. Her creative energy permeates her classes and creates a loving environment for learning. Always taking the lead from her students, you can expect a delightful exchange of ideas and fun!\n\nMarcy is also a professional singer and cantorial soloist, and a skilled piano teacher. She lives with her husband in Yonkers and is the mother of two beautiful adult daughters and Angie, the Musical Munchkins Spokes-Dog!","img_url":"https://imagedelivery.net/7urfTiC8XtiqnXYk5tfRRg/532d1403-dab5-43a6-e109-bb13a1da1700/public"},"staff_4":{"last_name":"Olin","first_name":"Amy","lives_in":"\"Pleasantville, NY\"","position":"Instructor","bio":"Amy came to us as a ‘Munchkins mom’ when her daughters, now young adults, were little munchkins. She was hooked from the start on our curriculum and philosophy of teaching. “I love sharing this fun-filled, gentle approach to music and movement with my munchkin students.” It nurtures a wonderful foundation of early enrichment. \n\nAs a PACE University graduate with a BA degree in elementary/early childhood education and a background in dance, theater and music, Amy enthusiastically joined the Musical Munchkins staff, delighted to be teaching her favorite age group. And having learned to play guitar as a child, it was the perfect niche. Her skill set and abilities lend themselves beautifully to educating our Munchkins.  \n\nAlso a group certified fitness instructor, Amy has had much experience teaching dance and fitness to adults and children. When she is not teaching her Munchkins, she’s usually busy teaching several ZUMBA classes a week as well as dabbling in the business end of Musical Munchkins, as Marketing/Media Manager overseeing advertising, marketing and social media. Amy lives in Pleasantville with her husband, Bill and her adorable dog, Georgia. Amy’s 2 lovely adult daughters have fond memories of being students of Musical Munchkins. ","img_url":"https://imagedelivery.net/7urfTiC8XtiqnXYk5tfRRg/44de8fd7-9996-4748-9ead-d80a814de400/public"},"staff_5":{"last_name":"Barrett","first_name":"Mila","position":"Instructor","bio":"Ludmila Barrett comes to us with extensive music education from Russia. She has a bachelor’s degree in music teaching from Kurenkeev Music College, a Masters degree in music and classical guitar from Beshenalieva Institute of Arts. Additionally, Mila holds a post-graduate degree in classical guitar performance from Kyrgyz State Conservatory. Mila taught classical guitar at a children’s music school in Bishkek, Kyrgyzstan, for ten years. She also performed classical guitar pieces, before moving to the United States where she has proudly become a citizen.\n\nA mother of two, Mila became interested in early childhood music education. After attending Musical Munchkins with her son, Mila expressed interest in teaching our program. Her success with moms and children is so evident. In a recent letter from a current parent, Miss Mila has been coined as “our very own Mary Poppins! She is truly a gift. She isn’t afraid to follow the kids’ leads, especially when they are full of energy.” We thank that parent for sharing her praises.\n\nMila has been a Musical Munchkins teacher since 2001 and currently teaches in our Armonk, Tuckahoe, and White Plains locations. Mila teaches private guitar lessons and has many students. She also teaches a music enrichment program at a Russian school. Mila believes every child has musical talent. She enjoys bringing that talent out in all of her students and watching them grow with music.","img_url":"https://imagedelivery.net/7urfTiC8XtiqnXYk5tfRRg/12accd0e-ebfd-453a-338f-0732cf33a400/public"},"staff_6":{"last_name":"Barbieri","first_name":"MaryEllen","position":"Instructor","bio":"MaryEllen discovered Musical Munchkins when she attended with her daughter, Lauren, a toddler at that time.  Because MaryEllen has Bachelor degrees in Music Therapy and Applied Voice from SUNY Fredonia, she truly appreciated the Musical Munchkins curriculum from a therapeutic as well as an early childhood developmental perspective.\n\nMaryEllen’s therapy work included head-injury rehabilitation and Alzheimer’s day treatment. Her professional work with children consisted of a therapy/developmental music curriculum when she served as a music specialist at Blythedale Children’s Hospital. \n\nMaryEllen also works as the Director of Family Ministries at Scarsdale Community Baptist Church. She is involved in many community groups and volunteers in many different capacities. ","img_url":"https://imagedelivery.net/7urfTiC8XtiqnXYk5tfRRg/76d9e8d5-0c93-4571-8a35-0c25deb1fa00/public"},"staff_7":{"last_name":"Sneider","first_name":"Robin","lives_in":"\"Dobbs Ferry, NY\"","position":"Instructor","bio":"Robin received her Bachelor of Music degree in Voice at the Eastman School of Music. She has performed as an opera singer, choral soloist and jingle singer. She moved from Manhattan to Westchester and discovered Musical Munchkins through friend and fellow teacher MaryEllen Barbieri.  \n\n“As a musician, I am impressed with how the program teaches young children all the fundamentals of music in a fun and active format. As a parent, I appreciate the gentle approach and the importance of treating each child as an individual.”\n\nHer teaching credits include Music Program Director at Breezemont Day Camp, music teacher at Orienta Beach Club’s summer camp, assistant at the Music Conservatory of Westchester’s Summer Camp and coaching private voice students.\n\nRobin has been with Musical Munchkins since 2006 and her gentle style with our youngest Munchkins have endeared her to the families she has in her classes. In her free time, Robin loves baking and doing jigsaw puzzles.","img_url":"https://imagedelivery.net/7urfTiC8XtiqnXYk5tfRRg/76fea2c1-0df5-4609-47ba-562f2488c600/public"},"staff_8":{"last_name":"Brown","first_name":"Angeline","lives_in":"\"Somers, NY\"","position":"Instructor","bio":"Angeline Brown has been a valued staff member with Musical Munchkins as a teacher and performer since 1999.  Angeline received a Bachelor of Arts with a piano concentration from Binghamton University in 1994, and a Master of Music Therapy Degree from Temple University in 1997.  \n\nAngeline has worked as a music therapist for the Music Therapy Institute at the Music Conservatory of Westchester for the past 15 years, as well as teaching classes and special programs for Musical Munchkins.  She also enjoys teaching piano and music directing at various community theaters in the Westchester and Putnam area. ","img_url":"https://imagedelivery.net/7urfTiC8XtiqnXYk5tfRRg/d017ce2b-3011-4e72-89f1-e6127c692200/public"},"staff_9":{"last_name":"Gandolfi","first_name":"Adrienne","lives_in":"\"Pleasantville, NY\"","position":"Instructor","bio":"Adrienne Gandolfi \nAdrienne received her B.A. in Music, and a Masters of Professional Studies at Manhattanville College. She earned a Masters of Music in classical and vocal performance at The New England Conservatory.  In addition, she has 3 New York State teaching certifications, and taught music to grades K-2 for 5 years at Virginia Road Elementary School in Valhalla. She has performed extensively in opera and musical theater, as well as on film and television.\n\nAdrienne has been very involved in music and theater from a very early age. After becoming a mom to adorable Audrey, she wanted to find a career path that would merge her love of music and her teaching experience with motherhood. Musical Munchkins was a perfect fit!  ","img_url":"https://imagedelivery.net/7urfTiC8XtiqnXYk5tfRRg/25f0a5e0-fedb-4a73-10d6-614a29efb600/public"},"staff_10":{"last_name":"Whynott","first_name":"Sandi","lives_in":"\"Pleasantville, NY\"","position":"Instructor","bio":"Sandi’s interest in music began at an early age. She studied 4 different musical instruments, and spent her childhood performing at church, school and in musical theater. She received her Bachelor of Arts from Connecticut College with a concentration in English and Music.\n\nSandi had a successful career in corporate human resources before discovering a new passion in early childhood education. She worked as an assistant teacher, a music teacher and soon became the head teacher at a local preschool. After 11 years of teaching, Sandi decided to combine her love of teaching with her musical talents at Musical Munchkins.\n\n“Exposure to music is so valuable during a child’s formative years. Music can stimulate cognitive, social, emotional and physical development. And children are so instinctively engaged in and drawn to music, that it’s a natural progression to growth.”\n\nSandi lives in Pleasantville with her husband and two lovely children, and continues her musical journey as a valued part of our staff. ","img_url":"https://imagedelivery.net/7urfTiC8XtiqnXYk5tfRRg/3ba4746c-6f71-4611-4336-0de6f4336e00/public"},"staff_11":{"last_name":"Moore","first_name":"Charlotte","lives_in":"\"Mount Vernon, NY\"","position":"Instructor","bio":"Charlotte brings to Musical Munchkins, more than twenty-five years of making music with the very young, the elderly, and everyone in-between.  A gifted educator and lifelong advocate for comprehensive arts education, in 1994, Charlotte began her career as a music educator in Mount Vernon City Schools.  As founding director of an Intergenerational Choir of Mount Vernon, she brought together elementary school students and senior citizens through an innovative after-school choral program that demonstrates the unique way music supports cross-generational respect and understanding.  At present, Charlotte teaches K-8 students at Traphagen Elementary School where she enjoys exploring rhythmic movement, sound exploration, and storytelling through music.\n\nBorn and raised in Westchester, Charlotte studied theory and classical piano with Jean Graham at Hoff-Barthelson Music School in Scarsdale, NY.  She holds a Bachelors degree in Music from Mt. Holyoke College, a Masters degree in Early Childhood Education from Fordham University, and an Administrative degree in Supervision from Mercy College.  Certified in Orff-Schulwerk instruction, Charlotte has completed training in Dalcroze Eurhythmics methodology, and is currently on faculty at the Music Conservatory of Westchester where she teaches early childhood music skills.  Charlotte is a long-time resident of White Plains, NY.","img_url":"https://imagedelivery.net/7urfTiC8XtiqnXYk5tfRRg/b16a0f7b-75d9-468c-c917-ad3ace1b6500/public"},"staff_12":{"last_name":"Mann","first_name":"Christine","lives_in":"\"White Plains, NY\"","position":"Instructor","bio":"Christine earned her Bachelor of Music in cello performance and Performance Certificate from the University of Massachusetts Amherst. Here she fell in love with teaching and pursued a Suzuki cello education at the School for Strings in NYC. She has performed in the New England and TriState area and has been teaching privately for 5 years. \n\nShe grew up in White Plains playing cello, guitar and dancing at the Music Conservatory of Westchester. Christine has always enjoyed working with children whether it be in music lessons, summer camp, or through child care. Her interest in working with younger children started through teaching cello lessons, and Musical Munchkins is where her passion for early childhood education and music align. ","img_url":"https://imagedelivery.net/7urfTiC8XtiqnXYk5tfRRg/55bd39ff-3811-42c1-988d-a493c322a800/public"}}